프로세스(process)는 컴퓨터에서 실행되고 있는 프로그램을 말하며 CPU 스케줄링의 대상이 되는 작업(task)이라는 용어와 함께 쓰인다. 스레드는 프로세스 내 작업의 흐름을 지칭한다.
![](https://velog.velcdn.com/images/pyoung/post/a6913d8c-a9e2-47f1-92c5-4f2e9ba11cb2/image.png)

프로그램이 메모리에 올라가면 프로세스가 되는 인스턴스화가 일어나고, 이후 운영체제의 CPU 스케줄러에 따라 CPU가 프로세스를 실행한다.

# 프로세스와 컴파일 과정
프로세스는 프로그램이 메모리에 올라가 인스턴스화된 것을 말한다. 프로그램을 만드는 과정은 만드는 언어마다 다를 수 있으며 컴파일 언어인 C 언어 기반의 프로그램의 경우, 컴파일러가 컴파일 과정을 통해 기계어로 번역하여 실행할 수 있는 파일을 만든다.
![](https://velog.velcdn.com/images/pyoung/post/d512ddb0-56ab-42b9-83c5-a24d733d6df5/image.png)

### 전처리
소스 코드의 주석을 제거하고 `#include` 등 헤더 파일을 병합하여 매크로를 치환한다.

### 컴파일러
오류 처리, 코드 최적화 작업을 하며 어셈블리어로 변환한다.

> #### 용어
**어셈블리어** : 기계어와 일대일 대응이 되는 컴퓨터 프로그래밍의 저급 언어

### 어셈블러
어셈블리어는 목적 코드(object code)로 변환된다. 확장자는 리눅스의 경우 `.o`이다.

### 링커
프로그램 내에 있는 라이브러리 함수 또는 다른 파일들과 목적 코드를 결합하여 실행 파일을 만든다. 실행 파일의 확장자는 `.exe` 또는 `.out`이라는 확장자를 갖는다.

#### 정적 라이브러리와 동적 라이브러리
정적 라이브러리는 프로그램 빌드 시 라이브러리가 제공하는 모든 코드를 실행 파일에 넣는 방식으로 라이브러리를 쓰는 방법이다. 시스템 환경 등 외부 의존도가 낮은 장점이 있지만 코드 중복 등 메모리 효율성이 떨어지는 단점이 있다.

동적 라이브러리는 프로그램 실행 시 필요할 때만 DLL(Dynamic-Link Library)이라는 함수 정보를 통해 참조하여 라이브러리를 쓰는 방법이다. 메모리 효율성에서의 장점을 지니지만 외부 의존도가 높아진다는 단점이 있다.

# 프로세스의 상태
![](https://velog.velcdn.com/images/pyoung/post/1f144264-7e49-47d4-bc1c-02ce760ef5d9/image.png)

### 생성
생성(create)은 프로세스가 생성된 상태를 의미하며 `fork()` 또는 `exec()` 함수를 통해 생성한다. 이때 PCB가 할당된다.

> PCB에 대한 설명은 밑에 있다.

#### `fork()`
부모 프로세스의 주소 공간을 그대로 복사하며, 새로운 자식 프로세스를 생성하는 함수이다. 주소 공간만 복사하며, 부모 프로세스의 비동기 작업 등을 상속하지 않는다.

#### `exec()`
새롭게 프로세스를 생성하는 함수이다.

### 대기
대기(ready)는 메모리 공간이 충분하면 메모리를 할당받고 아니면 아닌 상태로 대기하고 있으며, CPU 스케줄러로부터 CPU 소유권이 넘어오기를 기다리는 상태이다.

### 대기 중단
대기 중단(ready suspended)는 메모리 부족으로 일시 중단된 상태이다.

### 실행
실행(running)은 CPU 소유권과 메모리를 할당받고 인스트럭션을 수행 중인 상태를 의미한다. 이를 CPU burst가 일어났다고 표현한다.

### 중단
중단(blocked)은 어떤 이벤트가 발생한 이후 기다리며 프로세스가 차단된 상태이다. I/O 디바이스에 의한 인터럽트로 중단 현상이 자주 발생한다.

### 일시 중단
일시 중단(blocked suspended)은 대기 중단과 유사하다. 중단된 상태에서 프로세스가 실행되려고 했지만 메모리 부족으로 일시 중단된 상태이다.

### 종료
종료(terminated)는 메모리와 CPU 소유권을 모두 놓고 가는 상태를 말한다. 종료는 자연스럽게 종료되는 것도 있지만 부모 프로세스가 자식 프로세스를 강제시키는 비자발적 종료(abort)로 종료되는 것도 있다.

예를 들어 자식 프로세스에 할당된 자원의 한계치를 넘어서거나 부모 프로세스가 종료되거나 사용자가 `process.kill` 등 여러 명령어로 프로세스를 종료할 때 발생한다.

# 프로세스의 메모리 구조
![](https://velog.velcdn.com/images/pyoung/post/9415c660-1cda-4140-a299-452fc77016a3/image.png)

운영체제는 프로세스에 적절한 메모리를 할당하는데, 스택(stack), 힙(heap), 데이터 영역(BSS segment, Data segment), 코드 영역(code segment)으로 나눠진다.

### 스택과 힙
스택과 힙은 동적 할당이 되며, 동적 할당은 런타임 단계에서 메모리 할당받는 것을 말한다.

스택은 지역 변수, 매개 변수, 실행되는 함수에 의해 늘어들거나 줄어드는 메모리 영역이다. 함수가 호출될 때마다 특정 정보가 스택에 계속해서 저장된다. 또한, 재귀 함수가 호출될 때 새로운 스택 프레임이 매번 사용되기 때문에 함수 내의 변수 집합이 해당 함수의 다른 인스턴스 변수를 방해하지 않는다.

힙은 동적으로 할당되는 변수들을 담는다. `malloc()`, `free()` 함수를 통해 관리할 수 있으며 동적으로 관리되는 자료 구조의 경우 힙 영역을 사용한다.

### 데이터 영역과 코드 영역
정적 할당되는 영역이다. 정적 할당은 컴파일 단계에서 메모리를 할당하는 것을 말한다. 데이터 영역(BSS segment, Data segment)과 코드 영역(code/text segment)로 나뉘어 저장된다.

BSS segment는 전역 변수 또는 `static`, `const`로 선언되어 있고 0으로 초기화 또는 초기화가 어떠한 값으로 되어 있지 않은 변수들이 할당된다. Data segment는 전역 변수 또는 `static`, `const`로 선언되어 있고 0이 아닌 값으로 초기화된 변수가 할당된다.

code segment는 프로그램의 코드가 들어간다.

# PCB(Process Control Block)
운영체제에서 프로세스에 대한 메타데이터를 저장한 '데이터'를 말한다. 프로세스 제어 블록이라고도 한다. 프로세스가 생성되면 운영체제는 해당 PCB를 생성한다.

프로그램이 실행되면 프로세스가 생성되고 프로세스 주소 값들에 스택, 힙 등의 구조를 기반으로 메모리가 할당된다. 그리고 이 프로세스들의 메타데이터들이 PCB에 저장되어 관리된다. PCB는 프로세스의 중요한 정보를 포함하고  있기 때문에 일반 사용자가 접근하지 못하도록 커널 스택의 가장 앞부분에 관리된다.

> #### 용어
**메타데이터** : 데이터에 관한 구조화된 데이터이자 데이터를 설명하는 작은 데이터이다. 대량의 정보 가운데에서 찾고 있는 정보를 효율적으로 찾아내서 이용하기 위해 일정한 규칙에 따라 콘텐츠에 대해 부여되는 데이터이다.
**프로세스(process)** : 실행 중인 프로그램
**프로세서(processor)** : 프로세스를 실행시키는 주체로서 CPU를 지칭한다.
**프로시저(procedure)** : 루틴, 서브루틴, 함수와 같이 프로세스를 구성하는 부 프로그램을 지칭한다.

### PCB의 구조
- **프로세스 스케줄링 상태** : '준비', '일시중단' 등 프로세스가 CPU에 대한 소유권을 얻은 이후의 상태
- **프로세스 ID** : 프로세스 ID, 해당 프로세스의 자식 프로세스 ID
- **프로세스 권한** : 컴퓨터 자원 또는 I/O 디바이스에 대한 권한 정보
- **프로그램 카운터** : 프로세스에서 실행되어야 할 다음 명령어의 주소에 대한 포인터
- **CPU 레지스터** : 프로세스를 실행하기 위해 저장해야 할 레지스터에 대한 정보
- **CPU 스케줄링 정보** : CPU 스케줄러에 의해 중단된 시간 등에 대한 정보
- **계정 정보** : 프로세스 실행에 사용된 CPU 사용량, 실행할 유저의 정보
- **I/O 상태 정보** : 프로세스에 할당된 I/O 디바이스 목록

### 컨텍스트 스위칭(Context switching)
PCB를 기반으로 프로세스의 상태를 저장하고 로드시키는 과정을 말한다. 한 프로세스에 할당된 시간이 끝나거나 인터럽트에 의해 발생한다.

컴퓨터는 싱글코어 기준으로 어떠한 시점에서 실행되고 있는 프로세스는 단 한 개이며, 다른 프로세스와의 컨텍스트 스위칭이 아주 빠른 속도로 실행된다.
![](https://velog.velcdn.com/images/pyoung/post/e5a9f321-24f4-4238-9da5-9b264969eae4/image.png)

위의 그림처럼 프로세스 A가 실행하다 멈추고, 프로세스 A의 PCB를 저장하고 다시 프로세스 B의 PCB를 로드하여 실행한다. 그리고 다시 프로세스 B의 PCB를 저장하고 프로세스 A의 PCB를 로드한다. 컨텍스트 스위칭이 일어날 때 유휴 시간(idle time)이 발생한다. 뿐만 아니라 컨텍스트 스위칭에 드는 비용으로 캐시미스가 있다.

#### 비용 : 캐시미스
컨텍스트 스위칭이 일어날 때 프로세스가 가지고 있는 메모리 주소가 그대로 있으면 잘못된 주소 변환이 생기므로 캐시클리어 과정을 겪게 되고 이 때문에 캐시미스가 발생한다.

#### 스레드에서의 컨텍스트 스위칭
스레드는 스택 영역을 제외한 모든 메모리를 공유하기 때문에 스레드 컨텍스트 스위칭의 경우 비용이 더 적고 시간도 더 적게 걸린다.

# 멀티프로세싱
여러 개의 '프로세스', 즉 멀티프로세서를 통해 동시에 두 가지 이상의 일을 수행할 수 있는 것을 말한다. 이를 통해 하나 이상의 일을 병렬로 처리할 수 있으며 특정 프로세스의 메모리, 프로세스 중 일부에 문제가 발생되더라도 다른 프로세스를 이용해서 처리할 수 있으므로 신뢰성이 높은 강점이 있다.

### 웹 브라우저
웹 브라우저는 멀티프로세스 구조를 가지고 있으며 다음과 같다.
![](https://velog.velcdn.com/images/pyoung/post/700f6a29-3101-4813-bf5a-c4a9d5769af2/image.png)

- **브라우저 프로세스** : 주소 표시줄, 북마크 막대, 뒤로 가기 버튼, 앞으로 가기 버튼 등을 담당하며 네트워크 요청이나 파일 접근 같은 권한을 담당한다.
- **렌더러 프로세스** : 웹 사이트가 '보이는' 부분의 모든 것을 제어한다.
- **플러그인 프로세스** : 웹 사이트에서 사용하는 플러그인을 제어한다.
- **GPU 프로세스** : GPU를 이용해서 화면을 그리는 부분을 제어한다.

### IPC(Inter Process Communication)
프로세스끼리 데이터를 주고받고 공유 데이터를 관리하는 메커니즘을 말한다. 멀티프로세스는 IPC가 가능하다.

IPC의 종류로는 공유 메모리, 파일, 소켓, 익명 파이프, 명명 파이프, 메세지 큐가 있다. 이들 모두 메모리가 완전히 공유되는 스레드보다는 속도가 떨어진다.

#### 공유 메모리(Shared memory)
여러 프로세스에 동일한 메모리 블록에 대한 접근 권한이 부여되어 프로세스가 서로 통신할 수 있도록 공유 메모리를 생성해서 통신하는 것을 말한다.
![](https://velog.velcdn.com/images/pyoung/post/06600193-eacb-4d35-be2f-c76ed3bd99f9/image.png)

어떠한 매개체를 통해 데이터를 주고받는 것이 아닌 메모리 자체를 공유하기 때문에 불필요한 데이터 복사의 오버헤드가 발생하지 않아 가장 빠르지만, 동기화가 필요하다.

> #### 용어
- **오버헤드** : 특정 기능을 수행하는데 드는 간접적인 시간, 메모리 등 자원

#### 파일
디스크에 저장된 데이터 또는 파일 서버에서 제공한 데이터를 말한다. 이를 기반으로 프로세스 간 통신을 한다.

#### 소켓
동일한 컴퓨터의 다른 프로세스나 네트워크의 다른 컴퓨터로 네트워크 인터페이스를 통해 전송하는 데이터를 의미하며 TCP와 UDP가 있다.

#### 익명 파이프(Unnamed pipe)
프로세스 간에 FIFO 방식으로 읽히는 임시 공간인 파이프를 기반으로 데이터를 주고 받는다. 단방향 방식의 읽기 전용, 쓰기 전용 파이프를 만들어서 작동하는 방식이다.
![](https://velog.velcdn.com/images/pyoung/post/25c38bd9-b3d3-4a76-b0a6-40d971a50f29/image.png)

부모, 자식 프로세스 간에만 사용할 수 있으며 다른 네트워크 상에서는 사용이 불가능하다.

#### 명명된 파이프(Named pipe)
파이프 서버와 하나 이상의 파이프 클라이언트 간의 통신을 위해 명명된 단방향 또는 양방향 파이프이다. 클라이언트/서버 통신을 위한 별도의 파이프를 제공하며, 여러 파이프를 동시에 사용할 수 있다. 컴퓨터끼리 또는 다른 네트워크상의 컴퓨터와도 통신할 수 있다.
![](https://velog.velcdn.com/images/pyoung/post/2fb6d1d2-0873-4eac-a5f6-575d1bb65c44/image.png)

#### 메세지 큐
메세지를 큐(queue) 데이터 구조 형태로 관리하는 것을 말한다. 커널의 전역변수 형태 등 커널에서 전역적으로 관리되며 다른 IPC 방식에 비해 사용 방법이 매우 직관적이고 간단하며 간단하게 접근할 수 있다는 장점이 있다.
![](https://velog.velcdn.com/images/pyoung/post/73644c18-6b97-4f57-b022-6f76ecf64014/image.png)

공유 메모리를 통해 IPC를 구현할 때 쓰기 및 읽기 빈도가 높으면 동기화 때문에 기능을 구현하는 것이 복잡해지는데, 이때 대안으로 메세지 큐를 사용하기도 한다.

# 스레드와 멀티스레딩
### 스레드
프로세스의 실행 가능한 가장 작은 단위이다. 프로세스는 여러 스레드를 가질 수 있다.
![](https://velog.velcdn.com/images/pyoung/post/da1922a1-118b-4de8-a24f-d969b94858c2/image.png)

코드, 데이터, 스택, 힙을 각각 생성하는 프로세스와는 달리 스레드는 코드, 데이터, 힙은 스레드끼리 서로 공유한다.

### 멀티스레딩
프로세스 내 작업을 멀티스레드로 처리하는 기법이며 스레드끼리 서로 자원을 공유하기 때문에 효율성이 높다.

예를 들어 웹 요청을 처리할 때 훨씬 적은 리소스를 소비하며, 한 스레드가 중단(blocked)되어도 다른 스레드는 실행(running) 상태일 수 있기 때문에 중단되지 않은 빠른 처리가 가능하다. 또한 동시성의 장점이 있다. 하지만 한 스레드에 문제가 생기면 다른 스레드에도 영향을 끼쳐 프로세스에 영향을 줄 수 있다는 단점이 있다.

> #### 용어
- **동시성** : 서로 독립적인 작업들을 작은 단위로 나누고 동시에 실행되는 것처럼 보여주는 것

멀티스레드의 예로는 웹 브라우저의 렌더러 프로세스가 있다.
![](https://velog.velcdn.com/images/pyoung/post/2cf503a9-83c5-4926-a0b7-56ba91200ba8/image.png)

# 공유 자원과 임계 영역
### 공유 자원(Shared resource)
시스템 안에서 각 프로세스, 스레드가 함께 공동으로 이용할 수 있는 메모리, 파일, 데이터 등의 자원이나 변수 등을 의미한다. 이 공유 자원을 두 개 이상의 프로세스가 동시에 읽거나 쓰는 상황을 경쟁 상태(race condition)라고 한다. 동시에 접근을 시도할 때 접근의 타이밍이나 순서 등이 결과값에 영향을 줄 수 있는 상태다.
![](https://velog.velcdn.com/images/pyoung/post/b058e6f5-99f7-4683-a055-6fd1042c2cd9/image.png)

### 임계 영역(Critical sectoin)
둘 이상의 프로세스, 스레드가 공유 자원에 접근할 때 순서 등의 이유로 결과가 달라지는 코드 영역을 말한다. 임계 영역을 해결하기 위한 방법은 뮤텍스, 세마포어, 모니터가 있다. 이 방법 모두 상호 배제, 한정 대기, 융통성이라는 조건을 만족한다. 이 방법에 토대가 되는 메커니즘은 잠금(lock)이다.

> #### 용어
- **상호 배제** : 한 프로세스가 임계 영역에 들어갔을 때 다른 프로세스는 들어갈 수 없다.
- **한정 대기** : 특정 프로세스가 영원히 임계 영역에 들어가지 못하면 안된다.
- **융통성** : 어떠한 프로세스도 임계 영역을 사용하지 않는다면 임계 영역 외부의 어떠한 프로세스도 들어갈 수 있으며 이때 프로세스끼리 서로 방해하지 않는다.

#### 뮤텍스(Mutex)
프로세스나 스레드가 공유 자원을 `lock()`을 통해 잠금 설정하고 사용한 후에는 `unlock()`을 통해 잠금 해제하는 객체이다. 잠금이 설정되면 다른 프로세스나 스레드는 잠긴 코드 영역에 접근할 수 없다. 뮤텍스는 잠금 또는 잠금 해제라는 상태만을 가진다.
![](https://velog.velcdn.com/images/pyoung/post/bc62eb36-e871-4d27-9934-317da7027a35/image.png)

#### 세마포어(Semaphore)
일반화된 뮤텍스이다. 간단한 정수 값과 두 가지 함수 `wait`(P 함수라고도 함) 및 `signal`(V 함수라고도 함)로 공유 자원에 대한 접근을 처리한다.

`wait()`는 자신의 차례가 올 때까지 기다리는 함수이며, `signal()`은 다음 프로세스로 순서를 넘겨주는 함수이다.
![](https://velog.velcdn.com/images/pyoung/post/7c19c814-7b69-49d3-afd1-fff0179d9ae0/image.png)

프로세스나 스레드가 공유 자원에 접근하면 세마포어에서 `wait()` 작업을 수행하고 공유 자원을 해제하면 세마포어에서 `signal()` 작업을 수행한다. 세마포어에는 조건 변수가 없고 프로세스나 스레드가 세마포어 값을 수정할 때 다른 프로세스나 스레드는 동시에 세마포어 값을 수정할 수 없다.

**바이너리 세마포어**
0과 1의 두 가지 값만 가질 수 있는 세마포어이다. 구현의 유사성으로 인해 뮤텍스는 바이너리 세마포어라 할 수 있지만 엄밀히 말하면 뮤텍스는 잠금을 기반으로 상호배제가 일어나는 '잠금 메커니즘'이고, 세마포어는 신호를 기반으로 상호 배제가 일어나는 '신호 메커니즘'이다.

**카운팅 세마포어**
여러 개의 값을 가질 수 있는 세마포어이며, 여러 자원에 대한 접근을 제어하는데 사용된다.

#### 모니터
둘 이상의 스레드나 프로세스가 공유 자원에 안전하게 접근할 수 있도록 공유 자원을 숨기고 해당 접근에 대한 인터페이스만 제공한다.
![](https://velog.velcdn.com/images/pyoung/post/33ff54bd-49f1-4946-817b-1590982ee21b/image.png)

모니터는 모니터큐를 통해 공유 자원에 대한 작업들을 순차적으로 처리한다.

모니터는 세마포터보다 구현하기 쉬우며 모니터에서 상호 배제는 자동인 반면에, 세마포어에서는 상호 배제를 명시적으로 구현해야 한다는 차이점이 있다.

# 교착 상태(Deadlock)
두 개 이상의 프로세스들이 서로가 가진 자원을 기다리며 중단된 상태를 말한다.

### 교착 상태의 원인
- **상호 배제** : 한 프로세스가 자원을 독점하고 있으며 다른 프로세스들은 접근이 불가능하다.
- **점유 대기** : 특정 프로세스가 점유한 자원을 다른 프로세스가 요청하는 상태이다.
- **비선점** : 다른 프로세스의 자원을 강제적으로 가져올 수 없다.
- **환형 대기** : 서로가 서로의 자원을 요구하는 상황을 말한다.

### 교착 상태의 해결 방법
1. 자원을 할당할 때 애초에 조건이 성립되지 않도록 설계한다.
2. 교착 상태 가능성이 없을 때만 자원 할당되며, 프로세스당 요청할 자원들의 최대치를 통해 자원 할당 가능 여부를 파악하는 '은행원 알고리즘'을 쓴다.
3. 교착 상태가 발생하면 사이클이 있는지 찾아보고 이에 관련된 프로세스를 한 개씩 지운다.
4. 교착 상태는 매우 드물게 일어나기 때문에 이를 처리하는 비용이 더 커서 교착 상태가 발생하면 사용자가 작업을 종료한다.

> #### 용어
- **은행원 알고리즘** : 총 자원의 양과 현재 할당 가능한 자원의 양을 기준으로 안정 또는 불안정 상태로 나누고 안정 상태로 가도록 자원을 할당하는 알고리즘이다. 즉, 안정 상태를 유지할 수 있는 요구만을 수락한다.
> 
|안정 상태|불안정 상태|
|:-:|:-:|
|교착 상태 X|교착 상태 O|
|프로세스가 요구한 만큼 자원 할당 가능|프로세스가 요구한 만큼 자원 할당 불가능|
|안전 순서열 O|안전 순서열 X|

***
# Reference
- <a href="https://velog.io/@seorim0801/은행원-알고리즘" target="_blank">은행원 알고리즘?</a>
